-- MySQL dump 10.13  Distrib 8.0.31, for Win64 (x86_64)
--
-- Host: localhost    Database: mydb
-- ------------------------------------------------------
-- Server version	8.0.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `region`
--

DROP TABLE IF EXISTS `region`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `region` (
  `region_id` int NOT NULL AUTO_INCREMENT,
  `region` varchar(90) DEFAULT NULL,
  PRIMARY KEY (`region_id`)
) ENGINE=InnoDB AUTO_INCREMENT=87 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `region`
--

LOCK TABLES `region` WRITE;
/*!40000 ALTER TABLE `region` DISABLE KEYS */;
INSERT INTO `region` VALUES (1,'Алтайский край\r'),(2,'Амурская область\r'),(3,'Архангельская область\r'),(4,'Астраханская область\r'),(5,'Белгородская область\r'),(6,'Брянская область\r'),(7,'Владимирская область\r'),(8,'Волгоградская область\r'),(9,'Вологодская область\r'),(10,'Воронежская область\r'),(11,'г. Москва\r'),(12,'Еврейская автономная область\r'),(13,'Забайкальский край\r'),(14,'Ивановская область\r'),(15,'Иные территории, включая город и космодром Байконур\r'),(16,'Иркутская область\r'),(17,'Кабардино-Балкарская Республика\r'),(18,'Калининградская область\r'),(19,'Калужская область\r'),(20,'Камчатский край\r'),(21,'Карачаево-Черкесская Республика\r'),(22,'Кемеровская область — Кузбасс\r'),(23,'Кировская область\r'),(24,'Костромская область\r'),(25,'Краснодарский край\r'),(26,'Красноярский край\r'),(27,'Курганская область\r'),(28,'Курская область\r'),(29,'Ленинградская область\r'),(30,'Липецкая область\r'),(31,'Магаданская область\r'),(32,'Московская область\r'),(33,'Мурманская область\r'),(34,'Ненецкий автономный округ\r'),(35,'Нижегородская область\r'),(36,'Новгородская область\r'),(37,'Новосибирская область\r'),(38,'Омская область\r'),(39,'Оренбургская область\r'),(40,'Орловская область\r'),(41,'Пензенская область\r'),(42,'Пермский край\r'),(43,'Приморский край\r'),(44,'Псковская область\r'),(45,'Республика Адыгея (Адыгея)\r'),(46,'Республика Алтай\r'),(47,'Республика Башкортостан\r'),(48,'Республика Бурятия\r'),(49,'Республика Дагестан\r'),(50,'Республика Ингушетия\r'),(51,'Республика Калмыкия\r'),(52,'Республика Карелия\r'),(53,'Республика Коми\r'),(54,'Республика Крым\r'),(55,'Республика Марий Эл\r'),(56,'Республика Мордовия\r'),(57,'Республика Саха (Якутия)\r'),(58,'Республика Северная Осетия — Алания\r'),(59,'Республика Татарстан (Татарстан)\r'),(60,'Республика Тыва\r'),(61,'Республика Хакасия\r'),(62,'Ростовская область\r'),(63,'Рязанская область\r'),(64,'Самарская область\r'),(65,'Санкт-Петербург\r'),(66,'Саратовская область\r'),(67,'Сахалинская область\r'),(68,'Свердловская область\r'),(69,'Севастополь\r'),(70,'Смоленская область\r'),(71,'Ставропольский край\r'),(72,'Тамбовская область\r'),(73,'Тверская область\r'),(74,'Томская область\r'),(75,'Тульская область\r'),(76,'Тюменская область\r'),(77,'Удмуртская Республика\r'),(78,'Ульяновская область\r'),(79,'Хабаровский край\r'),(80,'Ханты-Мансийский автономный округ — Югра\r'),(81,'Челябинская область\r'),(82,'Чеченская Республика\r'),(83,'Чувашская Республика — Чувашия\r'),(84,'Чукотский автономный округ\r'),(85,'Ямало-Ненецкий автономный округ\r'),(86,'Ярославская область\r');
/*!40000 ALTER TABLE `region` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-10-30 23:31:58
